# Topic 5 - Reading data from files

# Reading Data from Excel

Pandas contain data structures and data manipulation tools designed for data cleaning and analysis.

While pandas adopt much code from NumPy, the difference is that Pandas is designed for tabular, heterogeneous data. NumPy, by difference, is best suited for working with homogeneous numerical array data.

The name Pandas is derived from the term 'panel data' (an econometrics term for multidimensional structured data sets).

In [2]:
#import pandas

import pandas as pd

In [3]:
# to read a xlsx file
df1 = pd.read_excel('employee_info.xlsx')
df1

    Age  Gender    Salary
0  45.0    Male   40000.0
1  12.0    Male       0.0
2  54.0  Female  150000.0
3  26.0    Male   30000.0
4  64.0  Female   15000.0
5  21.0  Female   25600.0

In [5]:
df1.axes

[RangeIndex(start=0, stop=6, step=1),
 Index(['Age', 'Gender', 'Salary'], dtype='object')]

In [6]:
df1.values

array([[45.0, 'Male', 40000.0],
       [12.0, 'Male', 0.0],
       [54.0, 'Female', 150000.0],
       [26.0, 'Male', 30000.0],
       [64.0, 'Female', 15000.0],
       [21.0, 'Female', 25600.0]], dtype=object)

In [7]:
df1.size

18

## head()
The head() method displays the first five rows of the data

In [40]:
df1.head()

    Age  Gender    Salary
0  45.0    Male   40000.0
1  12.0    Male       0.0
2  54.0  Female  150000.0
3  26.0    Male   30000.0
4  64.0  Female   15000.0

## tail()
The tail() method displays the last five rows of the data

In [6]:
df1.tail()

    Age  Gender    Salary
1  12.0    Male       0.0
2  54.0  Female  150000.0
3  26.0    Male   30000.0
4  64.0  Female   15000.0
5  21.0  Female   25600.0

## shape 
Check the dimension of the data using the shape attribute

In [7]:
df1.shape

(6, 3)

## dtypes
Check the data type of each variable in the data using the dtypes attribute

In [8]:
df1.dtypes

Age       float64
Gender     object
Salary    float64
dtype: object

## info()
The info() method returns the information about the shape, data type and null values in the data

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     6 non-null      float64
 1   Gender  6 non-null      object
 2   Salary  6 non-null      float64
dtypes: float64(2), object(1)
memory usage: 272.0+ bytes

In [10]:
df1.describe()

            Age         Salary
count   6.00000       6.000000
mean   37.00000   43433.333333
std    20.41568   53965.976936
min    12.00000       0.000000
25%    22.25000   17650.000000
50%    35.50000   27800.000000
75%    51.75000   37500.000000
max    64.00000  150000.000000

##  Accessing elements from the data

In [1]:
# to read a xlsx file
import pandas as pd
df1 = pd.read_excel('employee_info.xlsx')

df1

    Age  Gender    Salary
0  45.0    Male   40000.0
1  12.0    Male       0.0
2  54.0  Female  150000.0
3  26.0    Male   30000.0
4  64.0  Female   15000.0
5  21.0  Female   25600.0

#### To select a single column, use square brackets [ ] with the column name of the column

In [6]:
df1["Age"]

0    45.0
1    12.0
2    54.0
3    26.0
4    64.0
5    21.0
Name: Age, dtype: float64

#### To select multiple columns, use a list of column names within the selection brackets [ ].

In [7]:
df1[["Age" , "Salary"]]

    Age    Salary
0  45.0   40000.0
1  12.0       0.0
2  54.0  150000.0
3  26.0   30000.0
4  64.0   15000.0
5  21.0   25600.0

In [2]:
df1[df1["Gender"] == 'Male']

    Age Gender   Salary
0  45.0   Male  40000.0
1  12.0   Male      0.0
3  26.0   Male  30000.0

### .loc[ ] and .iloc[ ]

In [28]:
df1.loc[0]

Age          45.0
Gender       Male
Salary    40000.0
Name: 0, dtype: object

In [7]:
df1.loc[0,"Age"]

45.0

In [30]:
df1.loc[0,"Gender"]

'Male'

In [3]:
df1.loc[[1,3]]

    Age Gender   Salary
1  12.0   Male      0.0
3  26.0   Male  30000.0

In [5]:
df1.loc[[1,2,3],["Age","Salary"]]

    Age    Salary
1  12.0       0.0
2  54.0  150000.0
3  26.0   30000.0

In [34]:
df1.loc[df1["Age"] > 30, "Salary"]

0     40000.0
2    150000.0
4     15000.0
Name: Salary, dtype: float64

In [4]:
df1.loc[df1["Gender"] == 'Male']

    Age Gender   Salary
0  45.0   Male  40000.0
1  12.0   Male      0.0
3  26.0   Male  30000.0

In [5]:
df1.loc[df1["Age"] == 45]

    Age Gender   Salary
0  45.0   Male  40000.0

In [8]:
df1.iloc[0]

Age          45.0
Gender       Male
Salary    40000.0
Name: 0, dtype: object

In [43]:
# Retrieve the 4th, 5th, and 6th row in the DataFrame using the .iloc[]

df1.iloc[3:6]

    Age  Gender   Salary
3  26.0    Male  30000.0
4  64.0  Female  15000.0
5  21.0  Female  25600.0

In [10]:
df1.iloc[3:6, 0]

3    26.0
4    64.0
5    21.0
Name: Age, dtype: float64

In [13]:
df1.iloc[3:6, 1]

3      Male
4    Female
5    Female
Name: Gender, dtype: object

In [12]:
df1.iloc[3:6, 0:2]

    Age  Gender
3  26.0    Male
4  64.0  Female
5  21.0  Female

In [14]:
df1.loc[0]["Age"]

45.0

In [19]:
df1.iloc[0]["Age"]

45.0

In [18]:
df1.loc[0][["Age","Salary"]]

Age          45.0
Salary    40000.0
Name: 0, dtype: object

In [22]:
df1.iloc[0][["Age","Salary"]]

Age          45.0
Salary    40000.0
Name: 0, dtype: object

In [24]:
df1.loc[0:4][["Age","Salary"]]

    Age    Salary
0  45.0   40000.0
1  12.0       0.0
2  54.0  150000.0
3  26.0   30000.0
4  64.0   15000.0

In [25]:
df1.iloc[0:4][["Age","Salary"]]

    Age    Salary
0  45.0   40000.0
1  12.0       0.0
2  54.0  150000.0
3  26.0   30000.0

In [34]:
df1.loc[:][df1["Age"]>30]

    Age  Gender    Salary
0  45.0    Male   40000.0
2  54.0  Female  150000.0
4  64.0  Female   15000.0

In [33]:
df1.iloc[:][df1["Age"]>30]

    Age  Gender    Salary
0  45.0    Male   40000.0
2  54.0  Female  150000.0
4  64.0  Female   15000.0

In [41]:
df1.iloc[df1["Age"]>30][["Age", "Gender"]]

NotImplementedError: iLocation based boolean indexing on an integer type is not available

#  Reading Data From a CSV file.

The table of data in a spreadsheet can be saved in so-called CSV files, where **CSV**
stands for **comma separated values**. 

The CSV file format is very simple: each row in the spreadsheet table is a line in the file, and each cell in the row is separated by a comma or some other specified separation character. 

CSV files can easily be read into Python programs, and the table of cell data can be stored in a nested list, which can be processed as we desire. 

The modified table of cell data can be written back to a CSV file and read into the spreadsheet program for further processing.

## Reading CSV files

We start with loading the data into a table, represented as a nested list, with aid of
the csv module from Python’s standard library. This approach gives us complete
control of all details.

The csv module offers functionality for reading one line at a time from a CSV
file:

In [4]:
b = pd.read_csv('budget.csv')
b

  Unnamed: 0  Year1   Year2  Year3
0    Person1  12545   97856  75423
1    Person2  25412  456782  46587
2    Person3  35978   95431  24563

In [3]:
infile = open('budget.csv') # CSV file
import csv
table = []
for row in csv.reader(infile):
    table.append(row)
infile.close()

table

[['', 'Year1', 'Year2', 'Year3'],
 ['Person1', '12545', '97856', '75423'],
 ['Person2', '25412', '456782', '46587'],
 ['Person3', '35978', '95431', '24563']]

The row variable is a list of column values that are read from the file by the csv
module

We can easily print the table and can see how spreadsheet looks like when it is represented as a nested list in a Python program:

In [2]:
import pprint
pprint.pprint(table)

[['', 'Year1', 'Year2', 'Year3'],
 ['Person1', '12545', '97856', '75423'],
 ['Person2', '25412', '456782', '46587'],
 ['Person3', '35978', '95431', '24563']]

Observe now that all entries are surrounded by quotes, which means that all entries
are string (str) objects. 

This is a general rule: **The csv module reads all cells into string objects.**
    
To compute with the numbers, we need to transform the string objects to float objects.

The transformation should not be applied to the first row
and first column, since the cells here hold text. 

The transformation from strings to numbers therefore applies to the indices **r** and **c** in table **(table[r][c])**, such
that the row counter r goes from **1** to **len(table) - 1**, and the column counter c
goes from **1** to **len(table[0]) - 1**, (len(table[0]) is the length of the first row,
assuming the lengths of all rows are equal to the length of the first row).

In [5]:
for r in range(1,len(table)):
    for c in range(1, len(table[0])):
        table[r][c] = float(table[r][c])
pprint.pprint(table)

[['', 'Year1', 'Year2', 'Year3'],
 ['Person1', 12545.0, 97856.0, 75423.0],
 ['Person2', 25412.0, 456782.0, 46587.0],
 ['Person3', 35978.0, 95431.0, 24563.0]]

The numbers now have a decimal and no quotes, indicating that the numbers are
float objects and hence ready for mathematical calculations.

## Processing Spreadsheet Data

Let us perform a very simple calculation with table, namely adding a final row
with the sum of the numbers in the columns:

We first create a list row consisting of zeros. 

Then we insert a text in the first column, before we invoke a loop over the numbers in the table and compute
the sum of each column.

In [10]:
row = [0.0]*len(table[0])
row[0] = 'sum'
for c in range(1, len(row)):
    s = 0
    for r in range(1, len(table)):
        s += table[r][c]
        row[c] = s

pprint.pprint(table)

[['', 'Year1', 'Year2', 'Year3'],
 ['Person1', 12545.0, 97856.0, 75423.0],
 ['Person2', 25412.0, 456782.0, 46587.0],
 ['Person3', 35978.0, 95431.0, 24563.0],
 ['sum', 73935.0, 650069.0, 146573.0]]

## Q. Save the numbers and their squares into a file, numbers.csv, in the same directory as your programs. Write a  program to read this file.

In [1]:
import csv

def read_csv(filename):

    numbers = []
    squared = []
    t = []
    with open(filename) as f:
        reader = csv.reader(f)
        next(reader)
        for row in reader:
            print(row[0],"\n")
            t.append(row)
            numbers.append(int(row[0]))
            squared.append(int(row[1]))
            
        return t, numbers, squared

    

t, numbers, squared = read_csv('numbers.csv')
    
print(t,"\n")
print(numbers,"\n")
print(squared)

2

6

9

10

12

15

[['2', '4'], ['6', '36'], ['9', '81'], ['10', '100'], ['12', '144'], ['15', '225']]

[2, 6, 9, 10, 12, 15]

[4, 36, 81, 100, 144, 225]

In [4]:
t1=(1,2)
t2=(3,4)
t1_list=list(t1)
for n in t2:
    t1_list.append(n)
t1 = tuple(t1_list)
print(t1)

(1, 2, 3, 4)

In [5]:
l=[1,2,3,4,5]
print(l[-3:-1])

[3, 4]

In [ ]:
d1={a:200}
d2={b:3}
d3=copy